kakanada/stm32_load_pwm/stm32_load_pwm.c
/**
 ******************************************************************************
 * @file    stm32_load_pwm.c
 * @brief   Реализация библиотеки управления ШИМ-нагрузкой (см. stm32_load_pwm.h).
 * @author  Mechanic
 * @date    21.09.2026
 * @version 0.5
 *
 * @copyright Copyright (c) 2026 Mechanic.
 *            Свободное некоммерческое использование и модификация. Условия
 *            распространения - см. LICENSE / README.md в составе проекта.
 ******************************************************************************
 */

#include "stm32_load_pwm.h"
#include <math.h>   /* fmodf/logf/powf - используются только в Init/Start
                       (не в Tick - см. комментарии ниже) */

/* ------------------------------------------------------------------------ */
/*  Таблицы формы циклов индикации                                          */
/* ------------------------------------------------------------------------ */
/*
 * Каждая таблица - LOAD_PWM_TABLE_SIZE точек визуальной яркости (0..255) на
 * ПОЛНЫЙ период цикла. Размер зависит от LOAD_PWM_TABLE_QUALITY (см. .h):
 * скомпилируется только ОДИН из трёх ниже перечисленных наборов (32/64/128
 * точек) - остальные два отсекаются препроцессором и не занимают Flash.
 * Значения посчитаны один раз офлайн (не в прошивке) и зашиты как константы.
 */

#if LOAD_PWM_TABLE_QUALITY == 0
/* ===== LOW: 32 точки на цикл ===== */
static const uint8_t LOAD_PWM_TableMeandr[LOAD_PWM_TABLE_SIZE] =
{
    255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 255, 255,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0
};

static const uint8_t LOAD_PWM_TableBreath[LOAD_PWM_TABLE_SIZE] =
{
      0,  25,  50,  74,  98, 120, 142, 162, 180, 197, 212, 225,
    236, 244, 250, 254, 255, 254, 250, 244, 236, 225, 212, 197,
    180, 162, 142, 120,  98,  74,  50,  25
};

static const uint8_t LOAD_PWM_TablePulse[LOAD_PWM_TABLE_SIZE] =
{
      0,  50,  98, 142, 180, 212, 236, 250, 255, 250, 236, 212,
    180, 142,  98,  50,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0
};

static const uint8_t LOAD_PWM_TableTrapezoid[LOAD_PWM_TABLE_SIZE] =
{
      0, 128, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 128,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0
};

static const uint8_t LOAD_PWM_TableSawtooth[LOAD_PWM_TABLE_SIZE] =
{
      0,  17,  34,  51,  68,  85, 102, 119, 136, 153, 170, 187,
    204, 221, 238, 255,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0
};

static const uint8_t LOAD_PWM_TableTriangle[LOAD_PWM_TABLE_SIZE] =
{
      0,  17,  34,  51,  68,  85, 102, 119, 136, 153, 170, 187,
    204, 221, 238, 255, 255, 238, 221, 204, 187, 170, 153, 136,
    119, 102,  85,  68,  51,  34,  17,   0
};

static const uint8_t LOAD_PWM_TableDoubleBlink[LOAD_PWM_TABLE_SIZE] =
{
    255, 255, 255, 255,   0,   0,   0,   0,   0,   0,   0,   0,
    255, 255, 255, 255, 255, 255, 255, 255,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0
};

static const uint8_t LOAD_PWM_TableStrobe[LOAD_PWM_TABLE_SIZE] =
{
    255,   0, 255,   0, 255,   0, 255,   0, 255,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0
};

#elif LOAD_PWM_TABLE_QUALITY == 1
/* ===== MEDIUM: 64 точки на цикл ===== */
static const uint8_t LOAD_PWM_TableMeandr[LOAD_PWM_TABLE_SIZE] =
{
    255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 255, 255, 255, 255, 255, 255,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0
};

static const uint8_t LOAD_PWM_TableBreath[LOAD_PWM_TABLE_SIZE] =
{
      0,  13,  25,  37,  50,  62,  74,  86,  98, 109, 120, 131,
    142, 152, 162, 171, 180, 189, 197, 205, 212, 219, 225, 231,
    236, 240, 244, 247, 250, 252, 254, 255, 255, 255, 254, 252,
    250, 247, 244, 240, 236, 231, 225, 219, 212, 205, 197, 189,
    180, 171, 162, 152, 142, 131, 120, 109,  98,  86,  74,  62,
     50,  37,  25,  13
};

static const uint8_t LOAD_PWM_TablePulse[LOAD_PWM_TABLE_SIZE] =
{
      0,  25,  50,  74,  98, 120, 142, 162, 180, 197, 212, 225,
    236, 244, 250, 254, 255, 254, 250, 244, 236, 225, 212, 197,
    180, 162, 142, 120,  98,  74,  50,  25,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0
};

static const uint8_t LOAD_PWM_TableTrapezoid[LOAD_PWM_TABLE_SIZE] =
{
      0,  51, 102, 153, 204, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 204, 153, 102,  51,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0
};

static const uint8_t LOAD_PWM_TableSawtooth[LOAD_PWM_TABLE_SIZE] =
{
      0,   8,  16,  25,  33,  41,  49,  58,  66,  74,  82,  90,
     99, 107, 115, 123, 132, 140, 148, 156, 165, 173, 181, 189,
    197, 206, 214, 222, 230, 239, 247, 255,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0
};

static const uint8_t LOAD_PWM_TableTriangle[LOAD_PWM_TABLE_SIZE] =
{
      0,   8,  16,  25,  33,  41,  49,  58,  66,  74,  82,  90,
     99, 107, 115, 123, 132, 140, 148, 156, 165, 173, 181, 189,
    197, 206, 214, 222, 230, 239, 247, 255, 255, 247, 239, 230,
    222, 214, 206, 197, 189, 181, 173, 165, 156, 148, 140, 132,
    123, 115, 107,  99,  90,  82,  74,  66,  58,  49,  41,  33,
     25,  16,   8,   0
};

static const uint8_t LOAD_PWM_TableDoubleBlink[LOAD_PWM_TABLE_SIZE] =
{
    255, 255, 255, 255, 255, 255, 255, 255,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
    255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 255, 255,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0
};

static const uint8_t LOAD_PWM_TableStrobe[LOAD_PWM_TABLE_SIZE] =
{
    255, 255,   0,   0, 255, 255,   0,   0, 255, 255,   0,   0,
    255, 255,   0,   0, 255, 255,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0
};

#else
/* ===== HIGH: 128 точек на цикл (умолчание, как в версии 0.1) ===== */
static const uint8_t LOAD_PWM_TableMeandr[LOAD_PWM_TABLE_SIZE] =
{
    255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 255, 255,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0
};

static const uint8_t LOAD_PWM_TableBreath[LOAD_PWM_TABLE_SIZE] =
{
      0,   6,  13,  19,  25,  31,  37,  44,  50,  56,  62,  68,
     74,  80,  86,  92,  98, 103, 109, 115, 120, 126, 131, 136,
    142, 147, 152, 157, 162, 167, 171, 176, 180, 185, 189, 193,
    197, 201, 205, 208, 212, 215, 219, 222, 225, 228, 231, 233,
    236, 238, 240, 242, 244, 246, 247, 249, 250, 251, 252, 253,
    254, 254, 255, 255, 255, 255, 255, 254, 254, 253, 252, 251,
    250, 249, 247, 246, 244, 242, 240, 238, 236, 233, 231, 228,
    225, 222, 219, 215, 212, 208, 205, 201, 197, 193, 189, 185,
    180, 176, 171, 167, 162, 157, 152, 147, 142, 136, 131, 126,
    120, 115, 109, 103,  98,  92,  86,  80,  74,  68,  62,  56,
     50,  44,  37,  31,  25,  19,  13,   6
};

static const uint8_t LOAD_PWM_TablePulse[LOAD_PWM_TABLE_SIZE] =
{
      0,  13,  25,  37,  50,  62,  74,  86,  98, 109, 120, 131,
    142, 152, 162, 171, 180, 189, 197, 205, 212, 219, 225, 231,
    236, 240, 244, 247, 250, 252, 254, 255, 255, 255, 254, 252,
    250, 247, 244, 240, 236, 231, 225, 219, 212, 205, 197, 189,
    180, 171, 162, 152, 142, 131, 120, 109,  98,  86,  74,  62,
     50,  37,  25,  13,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0
};

static const uint8_t LOAD_PWM_TableTrapezoid[LOAD_PWM_TABLE_SIZE] =
{
      0,  21,  42,  64,  85, 106, 128, 149, 170, 191, 212, 234,
    255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 255, 255, 234, 212, 191, 170, 149, 128, 106,  85,
     64,  42,  21,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0
};

static const uint8_t LOAD_PWM_TableSawtooth[LOAD_PWM_TABLE_SIZE] =
{
      0,   4,   8,  12,  16,  20,  24,  28,  32,  36,  40,  45,
     49,  53,  57,  61,  65,  69,  73,  77,  81,  85,  89,  93,
     97, 101, 105, 109, 113, 117, 121, 125, 130, 134, 138, 142,
    146, 150, 154, 158, 162, 166, 170, 174, 178, 182, 186, 190,
    194, 198, 202, 206, 210, 215, 219, 223, 227, 231, 235, 239,
    243, 247, 251, 255,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0
};

static const uint8_t LOAD_PWM_TableTriangle[LOAD_PWM_TABLE_SIZE] =
{
      0,   4,   8,  12,  16,  20,  24,  28,  32,  36,  40,  45,
     49,  53,  57,  61,  65,  69,  73,  77,  81,  85,  89,  93,
     97, 101, 105, 109, 113, 117, 121, 125, 130, 134, 138, 142,
    146, 150, 154, 158, 162, 166, 170, 174, 178, 182, 186, 190,
    194, 198, 202, 206, 210, 215, 219, 223, 227, 231, 235, 239,
    243, 247, 251, 255, 255, 251, 247, 243, 239, 235, 231, 227,
    223, 219, 215, 210, 206, 202, 198, 194, 190, 186, 182, 178,
    174, 170, 166, 162, 158, 154, 150, 146, 142, 138, 134, 130,
    125, 121, 117, 113, 109, 105, 101,  97,  93,  89,  85,  81,
     77,  73,  69,  65,  61,  57,  53,  49,  45,  40,  36,  32,
     28,  24,  20,  16,  12,   8,   4,   0
};

static const uint8_t LOAD_PWM_TableDoubleBlink[LOAD_PWM_TABLE_SIZE] =
{
    255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 255, 255,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
    255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
    255, 255, 255, 255, 255, 255, 255, 255,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0
};

static const uint8_t LOAD_PWM_TableStrobe[LOAD_PWM_TABLE_SIZE] =
{
    255, 255, 255, 255, 255,   0,   0,   0,   0,   0, 255, 255,
    255, 255, 255,   0,   0,   0,   0,   0, 255, 255, 255, 255,
    255,   0,   0,   0,   0,   0, 255, 255, 255, 255, 255,   0,
      0,   0,   0,   0, 255, 255, 255, 255, 255,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
      0,   0,   0,   0,   0,   0,   0,   0
};

#endif

