kakanada/stm32_load_pwm/stm32_load_pwm.c
/** Таблица указателей на таблицы форм, индексируется LOAD_PWM_Cycle_t. */
static const uint8_t * const LOAD_PWM_Tables[LOAD_PWM_CYCLE_COUNT] =
{
    LOAD_PWM_TableMeandr,
    LOAD_PWM_TableBreath,
    LOAD_PWM_TablePulse,
    LOAD_PWM_TableTrapezoid,
    LOAD_PWM_TableSawtooth,
    LOAD_PWM_TableTriangle,
    LOAD_PWM_TableDoubleBlink,
    LOAD_PWM_TableStrobe,
};

/* ------------------------------------------------------------------------ */
/*  Статические пулы (без malloc)                                           */
/* ------------------------------------------------------------------------ */

static LOAD_PWM_Handle_t s_pool[LOAD_PWM_MAX_LOADS];

/** Отдельный пул таблиц гамма-коррекции - ТОЛЬКО для нагрузок типа
 *  LOAD_PWM_TYPE_LED (см. описание в начале .h). Размер каждой записи
 *  зависит от LOAD_PWM_RAM_QUALITY. Линейные нагрузки этот пул не трогают
 *  вообще - их скважность считается по формуле без всякой таблицы.
 *
 *  Размер массива - LOAD_PWM_LED_POOL_SIZE, а не напрямую LOAD_PWM_MAX_LEDS:
 *  если проект целиком без единого LED (законный, поощряемый в README
 *  случай - LOAD_PWM_MAX_LEDS=0 для проекта только с LOAD_PWM_TYPE_LINEAR),
 *  массив нулевого размера - нарушение ISO C99 (только GNU-расширение) и
 *  ломает сборку под -Wpedantic. Минимум 1 "неиспользуемый" слот вместо
 *  этого - несколько лишних байт, зато честная чистая компиляция. Слот не
 *  читается в рантайме при LOAD_PWM_MAX_LEDS=0 - см. LOAD_PWM_Init(). */
#define LOAD_PWM_LED_POOL_SIZE ((LOAD_PWM_MAX_LEDS > 0U) ? LOAD_PWM_MAX_LEDS : 1U)
static LOAD_PWM_Duty_t s_led_lut_pool[LOAD_PWM_LED_POOL_SIZE][LOAD_PWM_GAMMA_LUT_POINTS];

/** Монотонный счётчик занятых слотов s_led_lut_pool - слоты не
 *  освобождаются индивидуально (см. комментарий в LOAD_PWM_Init про
 *  повторную регистрацию и смену типа нагрузки на лету). */
static uint8_t s_led_lut_used_count = 0U;

/** Глобальный "ночной" множитель, см. LOAD_PWM_SetGlobalBrightness. Хранится
 *  как целочисленная дробь Q16 (0..LOAD_PWM_GLOBAL_MULT_FULL = 0..100%), А
 *  НЕ float - иначе load_pwm_write_output() на каждый Tick() каждой активной
 *  нагрузки платил бы за программную эмуляцию float (__aeabi_fmul и т.п.),
 *  что на МК без аппаратного FPU (Cortex-M0/M0+, например STM32F030)
 *  ощутимо дороже целочисленного умножения+сдвига - причём ПОСТОЯННО, даже
 *  если этой функцией никто не пользуется. Применяется только в момент
 *  финальной записи в CCR - внутреннее логическое состояние каждой нагрузки
 *  его не учитывает. */
#define LOAD_PWM_GLOBAL_MULT_SHIFT 16U
#define LOAD_PWM_GLOBAL_MULT_FULL  (1UL << LOAD_PWM_GLOBAL_MULT_SHIFT)
static uint32_t s_global_multiplier_q16 = LOAD_PWM_GLOBAL_MULT_FULL;

/* ------------------------------------------------------------------------ */
/*  Внутренние вспомогательные функции                                      */
/* ------------------------------------------------------------------------ */

/**
 * @brief  Ограничивает процент в диапазон 0..100.
 * @note   NaN-безопасно: сравнение "percent > 0.0f" (а не "percent < 0.0f")
 *         специально выбрано первым - у NaN ЛЮБОЕ сравнение с обычным числом
 *         по IEEE 754 ложно, поэтому "percent < 0.0f" для NaN тоже false, и
 *         NaN прошёл бы через обе проверки НЕИЗМЕНЁННЫМ (нашли бы бы этот
 *         сценарий, только протестировав явно) - а дальше NaN неизбежно
 *         попал бы в приведение float/double -> беззнаковый целый тип, что
 *         является неопределённым поведением по C99. Форма "!(percent>0.0f)"
 *         для NaN истинна (т.к. "percent>0.0f" для NaN ложно) - NaN уходит в
 *         безопасный 0.0f, как и любой другой некорректный/отрицательный
 *         вход. Поведение для нормальных чисел и +-inf не меняется.
 * @param  percent Значение процента (любое, включая NaN/inf).
 * @return Процент, ограниченный диапазоном [0, 100].
 */
static float load_pwm_clamp_percent(float percent)
{
    if (!(percent > 0.0f)) { return 0.0f; }
    if (percent > 100.0f)  { return 100.0f; }
    return percent;
}

/**
 * @brief  Переводит визуальную яркость (0..255) в значение ШИМ (тики CCR).
 *
 *         Для LOAD_PWM_TYPE_LINEAR (h->lut_index == LOAD_PWM_LUT_INDEX_NONE)
 *         - точная линейная формула, без всякой таблицы: LUT для линейной
 *         нагрузки просто не нужна (это не приближение, а математически
 *         точный результат).
 *
 *         Для LOAD_PWM_TYPE_LED - линейная интерполяция между двумя
 *         ближайшими узлами таблицы гамма-коррекции из ОТДЕЛЬНОГО пула
 *         s_led_lut_pool (см. LOAD_PWM_MAX_LEDS в .h) - не хранится в самом
 *         хэндле. Вызывается как из Tick() (продвижение цикла), так и вне
 *         её (SetBrightness) - в обоих случаях быстро (без деления, только
 *         сдвиг/маска/умножение).
 * @param  h      Хэндл нагрузки.
 * @param  visual Визуальная яркость (0..255).
 * @return Значение ШИМ (тики CCR).
 */
static LOAD_PWM_Duty_t load_pwm_visual_to_duty(const LOAD_PWM_Handle_t *h, uint16_t visual)
{
    if (visual >= 255U)
    {
        return h->pwm_max; /* точное верхнее значение, без интерполяционного зазора */
    }

    if (h->lut_index == LOAD_PWM_LUT_INDEX_NONE)
    {
        uint32_t range = (uint32_t)h->pwm_max - (uint32_t)h->pwm_min;
        return (LOAD_PWM_Duty_t)((uint32_t)h->pwm_min + ((range * (uint32_t)visual) / 255U));
    }

    const LOAD_PWM_Duty_t *lut = s_led_lut_pool[h->lut_index];
    uint32_t seg  = (uint32_t)visual >> LOAD_PWM_GAMMA_LUT_INDEX_SHIFT;
    uint32_t frac = (uint32_t)visual & LOAD_PWM_GAMMA_LUT_SEGMENTS_MASK;
    uint32_t d0 = lut[seg];
    uint32_t d1 = lut[seg + 1U];
    return (LOAD_PWM_Duty_t)(d0 + (((d1 - d0) * frac) >> LOAD_PWM_GAMMA_LUT_INDEX_SHIFT));
}

/**
 * @brief  Единая точка записи в CCR - применяет глобальный "ночной"
 *         множитель (LOAD_PWM_SetGlobalBrightness) к логическому (уже
 *         гамма-скорректированному) значению ПЕРЕД выводом в железо.
 *         Внутреннее состояние (background_pwm/current_pwm) всегда хранит
 *         логическое значение БЕЗ множителя.
 *
 *         Вызывается из Tick() на каждый активный тик каждой нагрузки -
 *         обычный случай (множитель == 100%, SetGlobalBrightness ни разу не
 *         вызывался или сброшен на 100%) оптимизирован до простого сравнения
 *         БЕЗ единого умножения - максимально быстро в том числе на МК без
 *         аппаратного умножителя/FPU. "Ночной режим" (множитель < 100%)
 *         платит за одно целочисленное 64-битное произведение вместо
 *         программной эмуляции float, которая потребовалась бы на МК без
 *         FPU (Cortex-M0/M0+).
 * @param  h            Хэндл нагрузки.
 * @param  logical_duty Логическая скважность (без глобального множителя).
 */
static void load_pwm_write_output(LOAD_PWM_Handle_t *h, LOAD_PWM_Duty_t logical_duty)
{
    uint32_t out;

    if (s_global_multiplier_q16 >= LOAD_PWM_GLOBAL_MULT_FULL)
    {
        out = (uint32_t)logical_duty;
    }
    else
    {
        /* 64-битное промежуточное произведение - безопасно от переполнения
         * для любого logical_duty (до UINT32_MAX при LOAD_PWM_RAM_QUALITY=
         * HIGH) и любого множителя (до LOAD_PWM_GLOBAL_MULT_FULL). */
        out = (uint32_t)(((uint64_t)logical_duty * s_global_multiplier_q16) >> LOAD_PWM_GLOBAL_MULT_SHIFT);
    }

    __HAL_TIM_SET_COMPARE(h->htim, h->channel, out);
}

/**
 * @brief  Переводит процент фоновой яркости (0..100, полная точность float)
 *         в тики ШИМ для LOAD_PWM_TYPE_LINEAR - НАПРЯМУЮ, без прохождения
 *         через 8-битное "визуальное" представление (0..255), которое в
 *         load_pwm_visual_to_duty существует только ради индексации гамма-LUT
 *         у LED. Если бы LINEAR-нагрузки использовали тот же 8-битный
 *         визуальный путь, что и LED (как было раньше) - LOAD_PWM_SetBrightness
 *         был бы искусственно ограничен 256 достижимыми уровнями скважности
 *         независимо от реального разрешения ARR/LOAD_PWM_RAM_QUALITY, что
 *         прямо противоречит заявленной "точной линейной формуле" для
 *         линейной нагрузки.
 * @param  h       Хэндл нагрузки (LOAD_PWM_TYPE_LINEAR).
 * @param  percent Процент яркости (0..100).
 * @return Значение ШИМ (тики CCR).
 */
static LOAD_PWM_Duty_t load_pwm_percent_to_duty_linear(const LOAD_PWM_Handle_t *h, float percent)
{
    /* double, а не float - у float не хватает точности мантиссы вплотную к
     * UINT32_MAX (актуально при LOAD_PWM_RAM_QUALITY=HIGH), из-за чего
     * duty_d при percent=100 мог бы округлиться ВВЕРХ за пределы диапазона,
     * представимого LOAD_PWM_Duty_t - приведение такого double->uint32_t
     * было бы неопределённым поведением по C99. Вызывается не из Tick() -
     * double не стоит производительности в горячем пути. */
    double range = (double)h->pwm_max - (double)h->pwm_min;
    double duty_d = (double)h->pwm_min + ((double)percent / 100.0) * range;
    return (LOAD_PWM_Duty_t)(duty_d + 0.5); /* округление, не усечение */
}

/**
 * @brief   Ищет свободный слот в пуле либо уже зарегистрированный (htim,
 *          channel) - для идемпотентности повторного LOAD_PWM_Init().
 * @param   htim    Таймер, для которого ищется слот.
 * @param   channel Канал таймера.
 * @return  Указатель на слот, либо NULL, если пул полон и совпадения не найдено.
 */
static LOAD_PWM_Handle_t *load_pwm_find_or_alloc_slot(TIM_HandleTypeDef *htim, uint32_t channel)
{
    uint32_t free_index = LOAD_PWM_MAX_LOADS;
    uint32_t has_free = 0U;

    for (uint32_t i = 0U; i < LOAD_PWM_MAX_LOADS; i++)
    {
        if (s_pool[i].used != 0U)
        {
            if ((s_pool[i].htim == htim) && ((uint32_t)s_pool[i].channel == channel))
            {
                return &s_pool[i]; /* уже зарегистрирован - переиспользуем */
            }
        }
        else if (has_free == 0U)
        {
            free_index = i;
            has_free = 1U;
        }
    }

    if (has_free == 0U)
    {
        return NULL; /* пул исчерпан */
    }
    return &s_pool[free_index];
}

/**
 * @brief  Общая внутренняя реализация запуска цикла (используется и
 *         LOAD_PWM_Start, и LOAD_PWM_StartOnce).
 * @param  h              Хэндл нагрузки.
 * @param  cycle          Форма цикла индикации.
 * @param  phase_shift    Сдвиг фазы (доля периода, 0..1).
 * @param  period_ms      Период цикла в миллисекундах.
 * @param  mode           Режим (повтор/однократно).
 * @param  allow_continue Разрешить не перезапускать уже идущий такой же REPEAT-цикл.
 * @return HAL_OK при успехе, HAL_ERROR при неверных аргументах.
 */
static HAL_StatusTypeDef load_pwm_start_internal(LOAD_PWM_Handle_t *h, LOAD_PWM_Cycle_t cycle,
                                                 float phase_shift, uint32_t period_ms,
                                                 LOAD_PWM_Mode_t mode, uint8_t allow_continue)
{
    if ((h == NULL) || (cycle >= LOAD_PWM_CYCLE_COUNT) || (period_ms == 0U))
    {
        if (h == NULL)
        {
            LOAD_PWM_LOG(LOAD_PWM_LOG_CODE_NULL_HANDLE, 0, 0);
        }
        return HAL_ERROR;
    }

    if ((allow_continue != 0U) && (h->mode == (uint8_t)LOAD_PWM_MODE_REPEAT) && (h->cycle_id == (uint8_t)cycle))
    {
        return HAL_OK;
    }

    double ticks_per_period = ((double)period_ms * (double)h->tick_freq_hz_cached) / 1000.0;
    if (ticks_per_period < 1.0)
    {
        ticks_per_period = 1.0;
    }

