kakanada/stm32_load_pwm/stm32_load_pwm.c
    /* 2^32 / кол-во тиков за период, округляется до ближайшего (а не
     * усекается) - иначе накопленная за период потеря дробной части
     * систематически сдвигает момент завершения периода на 1 лишний тик. */
    double inc = 4294967296.0 / ticks_per_period;
    uint32_t phase_inc = (inc >= 4294967295.0) ? 0xFFFFFFFFU : (uint32_t)(inc + 0.5);
    if (phase_inc == 0U)
    {
        phase_inc = 1U; /* защита от зависания на нулевом приращении */
    }

    float shift = fmodf(phase_shift, 1.0f);
    /* NaN-безопасно: fmodf(NaN, ...) и fmodf(+-inf, ...) по IEEE 754 дают
     * NaN, который "shift < 0.0f" ниже пропустил бы НЕИЗМЕНЁННЫМ (сравнение
     * NaN с чем угодно ложно) - а дальше NaN неизбежно попал бы в
     * приведение float -> uint32_t (через double), что UB по C99. isnan()
     * ловит и NaN-от-входа, и NaN-от-fmodf(inf,...), заменяя на safe 0.0f. */
    if (isnan(shift))
    {
        shift = 0.0f;
    }
    else if (shift < 0.0f)
    {
        shift += 1.0f;
    }
    uint32_t phase_acc = (uint32_t)((double)shift * 4294967296.0);

    h->fade_active = 0U;
    h->cycle_id  = (uint8_t)cycle;
    h->phase_inc = phase_inc;
    h->phase_acc = phase_acc;
    h->mode      = (uint8_t)mode;

    LOAD_PWM_LOG(LOAD_PWM_LOG_CODE_CYCLE_START, h->channel, (int32_t)cycle);

    return HAL_OK;
}

/* ------------------------------------------------------------------------ */
/*  Регистрация нагрузки                                                    */
/* ------------------------------------------------------------------------ */

LOAD_PWM_Handle_t *LOAD_PWM_Init(const LOAD_PWM_Config_t *config)
{
    if ((config == NULL) || (config->htim == NULL) || (config->tick_freq_hz == 0U))
    {
        LOAD_PWM_LOG(LOAD_PWM_LOG_CODE_INIT_BAD_CONFIG, 0, 0);
        return NULL;
    }

    LOAD_PWM_Handle_t *h = load_pwm_find_or_alloc_slot(config->htim, config->channel);
    if (h == NULL)
    {
        LOAD_PWM_LOG(LOAD_PWM_LOG_CODE_INIT_POOL_FULL, config->channel, LOAD_PWM_MAX_LOADS);
        return NULL; /* пул исчерпан */
    }

    /* Различаем "первая регистрация этого слота" от "повторный Init для
     * уже существующего физического (htim, channel)" - нужно, чтобы решить,
     * можно ли переиспользовать уже выделенный слот LUT (см. ниже). */
    uint8_t is_new_handle = (h->used == 0U);

    h->htim = config->htim;
    h->channel = (uint8_t)config->channel;
    h->tick_source_id = config->tick_source_id;
    h->tick_freq_hz_cached = config->tick_freq_hz;

    uint32_t arr = __HAL_TIM_GET_AUTORELOAD(config->htim);
    float min_p = load_pwm_clamp_percent(config->brightness_min_percent);
    float max_p = load_pwm_clamp_percent(config->brightness_max_percent);
    if (max_p < min_p)
    {
        float tmp = max_p;
        max_p = min_p;
        min_p = tmp;
    }

    /* Тип скважности (LOAD_PWM_Duty_t) может быть уже uint8_t/uint16_t (см.
     * LOAD_PWM_RAM_QUALITY) - насыщаем расчётное значение сверху пределом
     * выбранного типа, если ARR канала больше, чем этот тип способен
     * выразить (сознательный компромисс ради экономии RAM). Сравнение с
     * пределом типа - в double, а не float: у float 24-битная мантисса не
     * может точно представить значения около UINT32_MAX (при
     * LOAD_PWM_RAM_QUALITY=HIGH), из-за чего сравнение "> duty_type_max"
     * могло не сработать вплотную к границе, и последующее приведение
     * float->uint32_t стало бы неопределённым поведением по C99. double
     * представляет весь диапазон uint32_t точно, стоит это только в Init(),
     * не в Tick(). */
    double pwm_min_d = ((double)min_p / 100.0) * (double)arr;
    double pwm_max_d = ((double)max_p / 100.0) * (double)arr;
    if (pwm_min_d > (double)LOAD_PWM_DUTY_MAX) { pwm_min_d = (double)LOAD_PWM_DUTY_MAX; }
    if (pwm_max_d > (double)LOAD_PWM_DUTY_MAX) { pwm_max_d = (double)LOAD_PWM_DUTY_MAX; }
    h->pwm_min = (LOAD_PWM_Duty_t)pwm_min_d;
    h->pwm_max = (LOAD_PWM_Duty_t)pwm_max_d;

    if (config->load_type == LOAD_PWM_TYPE_LED)
    {
        /* Новый слот LUT нужен, если хэндл только что создан, либо раньше
         * был LOAD_PWM_TYPE_LINEAR (у него не было LUT) - иначе спокойно
         * переиспользуем уже выделенный h->lut_index. */
        if (is_new_handle || (h->lut_index == LOAD_PWM_LUT_INDEX_NONE))
        {
#if LOAD_PWM_MAX_LEDS == 0U
            /* Проект без единого LED (LOAD_PWM_MAX_LEDS=0) - пул LUT
             * отсутствует по определению, LED-нагрузка зарегистрирована
             * быть не может. #if, а не рантайм-сравнение с константой 0 -
             * иначе "s_led_lut_used_count >= 0" (u8 >= 0) триггерит
             * -Wtype-limits как "сравнение всегда истинно". */
            LOAD_PWM_LOG(LOAD_PWM_LOG_CODE_INIT_LED_POOL_FULL, config->channel, LOAD_PWM_MAX_LEDS);
            return NULL;
#else
            if (s_led_lut_used_count >= LOAD_PWM_MAX_LEDS)
            {
                LOAD_PWM_LOG(LOAD_PWM_LOG_CODE_INIT_LED_POOL_FULL, config->channel, LOAD_PWM_MAX_LEDS);
                return NULL; /* пул LUT для LED исчерпан - см. LOAD_PWM_MAX_LEDS */
            }
#endif
            h->lut_index = s_led_lut_used_count;
            s_led_lut_used_count++;
        }

        /*
         * Гамма-коррекция: ищем степенную кривую u(x) = x^gamma, точно
         * проходящую через три опорные точки (0 -> pwm_min, 0.5 -> pwm_mid,
         * 1 -> pwm_max), из u(0.5) = 0.5^gamma = u_mid находим
         * gamma = log(u_mid) / log(0.5) - см. подробности в README.md.
         *
         * Упрощённая калибровка: если brightness_mid_percent < 0 (точка не
         * измерена) - берём типовое LOAD_PWM_DEFAULT_LED_GAMMA вместо
         * калибровки по факту.
         */
        float gamma;
        uint32_t pwm_min_u = (uint32_t)h->pwm_min;
        uint32_t pwm_max_u = (uint32_t)h->pwm_max;

        if (config->brightness_mid_percent < 0.0f)
        {
            gamma = LOAD_PWM_DEFAULT_LED_GAMMA;
        }
        else if (pwm_max_u > pwm_min_u)
        {
            float mid_p = load_pwm_clamp_percent(config->brightness_mid_percent);
            /* double по той же причине, что и pwm_min/pwm_max выше. */
            uint32_t pwm_mid_u = (uint32_t)(((double)mid_p / 100.0) * (double)arr);
            float u_mid = ((float)pwm_mid_u - (float)pwm_min_u) / ((float)pwm_max_u - (float)pwm_min_u);
            if (u_mid < 0.01f) { u_mid = 0.01f; }
            if (u_mid > 0.99f) { u_mid = 0.99f; }
            gamma = logf(u_mid) / logf(0.5f);
            if (gamma < 0.2f) { gamma = 0.2f; }
            if (gamma > 6.0f) { gamma = 6.0f; }
        }
        else
        {
            gamma = 1.0f;
        }

        /* Считается один раз здесь (не в Tick()!) и раскладывается в
         * таблицу отдельного пула - при вызовах Tick() остаётся только
         * быстрая линейная интерполяция, без вызова powf() каждый раз. */
        LOAD_PWM_Duty_t *lut = s_led_lut_pool[h->lut_index];
        for (uint32_t i = 0U; i < LOAD_PWM_GAMMA_LUT_POINTS; i++)
        {
            float frac = (float)i / (float)LOAD_PWM_GAMMA_LUT_SEGMENTS;
            float u = powf(frac, gamma);
            /* Насыщение в double по той же причине, что и pwm_min/pwm_max
             * выше - у float не хватает мантиссы вплотную к UINT32_MAX. */
            double duty_d = (double)pwm_min_u + (double)u * ((double)pwm_max_u - (double)pwm_min_u);
            if (duty_d > (double)LOAD_PWM_DUTY_MAX) { duty_d = (double)LOAD_PWM_DUTY_MAX; }
            if (duty_d < 0.0) { duty_d = 0.0; }
            lut[i] = (LOAD_PWM_Duty_t)(duty_d + 0.5);
        }
    }
    else
    {
        /* LOAD_PWM_TYPE_LINEAR - LUT не нужна вообще (см. load_pwm_visual_to_duty). */
        h->lut_index = LOAD_PWM_LUT_INDEX_NONE;
    }

