kakanada/stm32_load_pwm/stm32_load_pwm.c
    /* Запуск периферии ШИМ - идемпотентно безопасно вызывать даже если уже
     * запущена. Никакой "главный" таймер библиотека сама не трогает -
     * обеспечение периодичности вызова LOAD_PWM_Tick() полностью на
     * пользователе (см. stm32_load_pwm.h). Возврат проверяем ДО того, как
     * трогать рабочее (операционное) состояние хэндла - если это была
     * переинициализация УЖЕ активной нагрузки (is_new_handle == 0) и
     * HAL_TIM_PWM_Start вернул ошибку, нагрузка должна продолжить работать
     * ровно как работала (её текущий цикл/фон/фейд не должны молча
     * сброситься) - NULL означает "ничего не изменилось", а не "нагрузка
     * тихо остановлена". pwm_min/pwm_max/lut_index (калибровка) назад не
     * откатываются даже при ошибке - это не "работающее прямо сейчас"
     * состояние, а настройки для следующего успешного Init(). */
    HAL_StatusTypeDef pwm_start_status = HAL_TIM_PWM_Start(config->htim, config->channel);
    if (pwm_start_status != HAL_OK)
    {
        /* Для НОВОГО хэндла used ещё не выставлен (см. ниже) - слот и так
         * свободен, откатывать нечего. Слот LUT (если выделялся) не
         * освобождается индивидуально - см. комментарий у
         * s_led_lut_used_count. */
        LOAD_PWM_LOG(LOAD_PWM_LOG_CODE_INIT_HAL_START_FAIL, config->channel, (int32_t)pwm_start_status);
        return NULL;
    }

    /* Цикл не запущен, фоновая яркость по умолчанию - 0%, фейда нет. Эта
     * "операционная" часть состояния намеренно выставляется ТОЛЬКО после
     * успешного старта PWM - см. комментарий выше. */
    h->cycle_id        = (uint8_t)LOAD_PWM_CYCLE_MEANDR;
    h->mode            = (uint8_t)LOAD_PWM_MODE_NONE;
    h->phase_acc       = 0U;
    h->phase_inc       = 0U;
    h->background_pwm  = h->pwm_min;
    h->current_pwm     = h->pwm_min;
    h->fade_active     = 0U;
    h->used            = 1U;

    load_pwm_write_output(h, h->background_pwm);

    LOAD_PWM_LOG(LOAD_PWM_LOG_CODE_INIT_OK, config->channel, (int32_t)config->load_type);

    return h;
}

/* ------------------------------------------------------------------------ */
/*  Фоновая яркость                                                          */
/* ------------------------------------------------------------------------ */

HAL_StatusTypeDef LOAD_PWM_SetBrightness(LOAD_PWM_Handle_t *h, float percent, uint32_t fade_ms)
{
    if (h == NULL)
    {
        LOAD_PWM_LOG(LOAD_PWM_LOG_CODE_NULL_HANDLE, 0, 0);
        return HAL_ERROR;
    }

    float p = load_pwm_clamp_percent(percent);
    LOAD_PWM_Duty_t target_pwm;

    if (h->lut_index == LOAD_PWM_LUT_INDEX_NONE)
    {
        /* LOAD_PWM_TYPE_LINEAR - полное разрешение, см. комментарий у
         * load_pwm_percent_to_duty_linear. */
        target_pwm = load_pwm_percent_to_duty_linear(h, p);
    }
    else
    {
        /* LOAD_PWM_TYPE_LED - через 8-битное "визуальное" представление
         * (разрешение интерполяции гамма-LUT), округляем, а не усекаем. */
        uint16_t visual = (uint16_t)((p * 2.55f) + 0.5f); /* 0..100% -> 0..255 */
        if (visual > 255U)
        {
            visual = 255U;
        }
        target_pwm = load_pwm_visual_to_duty(h, visual);
    }

    h->background_pwm = target_pwm;

    if (h->mode != (uint8_t)LOAD_PWM_MODE_NONE)
    {
        /* Сейчас активен цикл - новое фоновое значение только запоминается
         * и будет применено МГНОВЕННО по остановке/завершению цикла. */
        h->fade_active = 0U;
        return HAL_OK;
    }

    if (fade_ms == 0U)
    {
        h->fade_active = 0U;
        h->current_pwm = target_pwm;
        load_pwm_write_output(h, target_pwm);
        return HAL_OK;
    }

    /* Плавный переход - ТОЛЬКО между фоновыми значениями, пока нагрузка
     * простаивает (реализация шага - в LOAD_PWM_Tick). Стартует от текущего
     * фактического значения (h->current_pwm), поэтому повторный вызов
     * посреди уже идущего фейда плавно переопределяет цель. */
    double ticks_d = ((double)fade_ms * (double)h->tick_freq_hz_cached) / 1000.0;
    /* Насыщение ДО приведения к uint32_t - без него очень длинный fade_ms в
     * сочетании с высокой tick_freq_hz мог бы дать ticks_d за пределами
     * диапазона uint32_t, а double->uint32_t с выходящим за диапазон
     * значением - неопределённое поведение по C99 (тот же класс проблемы,
     * что и с phase_inc в load_pwm_start_internal, там уже так насыщено). */
    if (ticks_d > 4294967295.0)
    {
        ticks_d = 4294967295.0;
    }
    uint32_t ticks = (uint32_t)(ticks_d + 0.5);
    if (ticks == 0U)
    {
        ticks = 1U;
    }

    h->fade_step            = ((float)target_pwm - (float)h->current_pwm) / (float)ticks;
    h->fade_current_pwm     = (float)h->current_pwm;
    h->fade_ticks_remaining = ticks;
    h->fade_active          = 1U;

    return HAL_OK;
}

/* ------------------------------------------------------------------------ */
/*  Управление циклами индикации                                            */
/* ------------------------------------------------------------------------ */

HAL_StatusTypeDef LOAD_PWM_Start(LOAD_PWM_Handle_t *h, LOAD_PWM_Cycle_t cycle,
                                  float phase_shift, uint32_t period_ms)
{
    return load_pwm_start_internal(h, cycle, phase_shift, period_ms, LOAD_PWM_MODE_REPEAT, 1U);
}

HAL_StatusTypeDef LOAD_PWM_StartOnce(LOAD_PWM_Handle_t *h, LOAD_PWM_Cycle_t cycle,
                                      float phase_shift, uint32_t period_ms)
{
    return load_pwm_start_internal(h, cycle, phase_shift, period_ms, LOAD_PWM_MODE_ONESHOT, 0U);
}

HAL_StatusTypeDef LOAD_PWM_Stop(LOAD_PWM_Handle_t *h)
{
    if (h == NULL)
    {
        LOAD_PWM_LOG(LOAD_PWM_LOG_CODE_NULL_HANDLE, 0, 0);
        return HAL_ERROR;
    }

    h->mode        = (uint8_t)LOAD_PWM_MODE_NONE;
    h->fade_active = 0U;
    h->current_pwm = h->background_pwm;
    load_pwm_write_output(h, h->background_pwm);

    LOAD_PWM_LOG(LOAD_PWM_LOG_CODE_STOP, h->channel, 0);

    return HAL_OK;
}

void LOAD_PWM_StopAll(void)
{
    uint32_t stopped_count = 0U;

    for (uint32_t i = 0U; i < LOAD_PWM_MAX_LOADS; i++)
    {
        if (s_pool[i].used == 0U)
        {
            continue;
        }

        LOAD_PWM_Handle_t *h = &s_pool[i];
        h->mode        = (uint8_t)LOAD_PWM_MODE_NONE;
        h->fade_active = 0U;
        h->current_pwm = h->background_pwm;
        load_pwm_write_output(h, h->background_pwm);
        stopped_count++;
    }

