kakanada/stm32_load_pwm/stm32_load_pwm.c
    /* Один агрегированный лог на весь вызов, а не по одному на нагрузку -
     * StopAll() уже сам по себе редкий/аварийный вызов, но нагрузок может
     * быть LOAD_PWM_MAX_LOADS штук, лог по каждой был бы спамом. */
    LOAD_PWM_LOG(LOAD_PWM_LOG_CODE_STOP_ALL, 0, (int32_t)stopped_count);
}

/* ------------------------------------------------------------------------ */
/*  Глобальный множитель яркости ("ночной режим")                           */
/* ------------------------------------------------------------------------ */

void LOAD_PWM_SetGlobalBrightness(float percent)
{
    float p = load_pwm_clamp_percent(percent);

    /* float/double здесь не проблема - функция вызывается редко (не из
     * Tick()), в отличие от load_pwm_write_output(). +0.5 - округление, не
     * усечение; при percent=100 даёт ровно LOAD_PWM_GLOBAL_MULT_FULL, что
     * включает быстрый путь без умножения в load_pwm_write_output(). */
    s_global_multiplier_q16 = (uint32_t)(((double)p / 100.0) * (double)LOAD_PWM_GLOBAL_MULT_FULL + 0.5);

    LOAD_PWM_LOG(LOAD_PWM_LOG_CODE_GLOBAL_BRIGHTNESS, 0, (int32_t)(p + 0.5f));

    /* Активные циклы/фейды сами подхватят новый множитель на следующем
     * вызове LOAD_PWM_Tick() для них - а вот простаивающие (статичный фон)
     * нужно перерисовать сейчас же. */
    for (uint32_t i = 0U; i < LOAD_PWM_MAX_LOADS; i++)
    {
        if (s_pool[i].used == 0U)
        {
            continue;
        }

        LOAD_PWM_Handle_t *h = &s_pool[i];
        if ((h->mode == (uint8_t)LOAD_PWM_MODE_NONE) && (h->fade_active == 0U))
        {
            load_pwm_write_output(h, h->current_pwm);
        }
    }
}

/* ------------------------------------------------------------------------ */
/*  Периодическое обновление                                                */
/* ------------------------------------------------------------------------ */

void LOAD_PWM_Tick(uint32_t tick_source_id)
{
    for (uint32_t i = 0U; i < LOAD_PWM_MAX_LOADS; i++)
    {
        LOAD_PWM_Handle_t *h = &s_pool[i];

        if ((h->used == 0U) || (h->tick_source_id != tick_source_id))
        {
            continue;
        }

        if (h->mode != (uint8_t)LOAD_PWM_MODE_NONE)
        {
            /* Активен цикл индикации - продвигаем фазу. */
            uint32_t old_acc = h->phase_acc;
            uint32_t new_acc = old_acc + h->phase_inc;
            h->phase_acc = new_acc;

            if (new_acc < old_acc) /* переполнение (wrap) - период завершён */
            {
                if (h->mode == (uint8_t)LOAD_PWM_MODE_ONESHOT)
                {
                    h->mode = (uint8_t)LOAD_PWM_MODE_NONE;
                    h->current_pwm = h->background_pwm;
                    load_pwm_write_output(h, h->background_pwm);
                    /* Событие редкое (раз на завершившийся цикл, не на тик) -
                     * не спам, в отличие от лога на каждый LOAD_PWM_Tick(). */
                    LOAD_PWM_LOG(LOAD_PWM_LOG_CODE_CYCLE_DONE, h->channel, (int32_t)h->cycle_id);
                    continue; /* цикл завершён - яркость на этом такте больше не трогаем */
                }
                /* LOAD_PWM_MODE_REPEAT - остаток (new_acc) уже корректно
                 * "перенесён" на новый период, ничего специально сбрасывать
                 * не нужно. */
            }

            /* cycle_table намеренно НЕ кэшируется в хэндле - берём указатель
             * прямо из глобальной таблицы LOAD_PWM_Tables по cycle_id.
             * Стоимость идентична кэшированному указателю (одно обращение к
             * массиву что так, что так), но экономит 4 байта в каждом
             * хэндле - без потери скорости. */
            uint32_t idx = new_acc >> (32U - LOAD_PWM_TABLE_BITS);
            uint8_t visual = LOAD_PWM_Tables[h->cycle_id][idx];
            LOAD_PWM_Duty_t duty = load_pwm_visual_to_duty(h, (uint16_t)visual);

            h->current_pwm = duty;
            load_pwm_write_output(h, duty);
        }
        else if (h->fade_active != 0U)
        {
            /* Цикл не запущен, но идёт плавный переход фоновой яркости -
             * делаем один шаг фейда. */
            h->fade_ticks_remaining--;
            h->fade_current_pwm += h->fade_step;

            if (h->fade_ticks_remaining == 0U)
            {
                h->fade_active = 0U;
                h->current_pwm = h->background_pwm; /* точное целевое значение, без накопленной погрешности float */
            }
            else
            {
                /* Защита от накопленной погрешности float на длинных фейдах
                 * с обеих сторон диапазона - без неё fade_current_pwm
                 * теоретически может чуть выйти за [0, LOAD_PWM_DUTY_MAX]
                 * перед последним тиком, а приведение float-значения за
                 * пределами представимого диапазона беззнакового типа -
                 * неопределённое поведение по стандарту C.
                 *
                 * Верхняя граница сравнивается НЕ с (float)LOAD_PWM_DUTY_MAX
                 * напрямую - при LOAD_PWM_RAM_QUALITY=HIGH (uint32_t) само
                 * значение UINT32_MAX не представимо в float точно (не
                 * хватает мантиссы) и округлилось бы ВВЕРХ до 2^32, что
                 * сделало бы сравнение бесполезным. Сравниваем со следующей
                 * степенью двойки (LOAD_PWM_DUTY_MAX + 1) - она ВСЕГДА точно
                 * представима в float (256 / 65536 / 2^32) - и при
                 * попадании в "верхнюю" ветку берём точное целочисленное
                 * значение LOAD_PWM_DUTY_MAX напрямую, вообще не приводя
                 * float к целому типу в этом случае. */
                float clamped = h->fade_current_pwm;
                if (clamped < 0.0f)
                {
                    h->current_pwm = 0U;
                }
                else if (clamped >= (float)((double)LOAD_PWM_DUTY_MAX + 1.0))
                {
                    h->current_pwm = LOAD_PWM_DUTY_MAX;
                }
                else
                {
                    h->current_pwm = (LOAD_PWM_Duty_t)clamped;
                }
            }

            load_pwm_write_output(h, h->current_pwm);
        }
        else
        {
            /* Простаивает, фейда нет - трогать нечего, экономим время. */
        }
    }
}
